{
  "auteurs" : [
    {
      "name" : "Wes Anderson",
      "bio" : "Wesley Wales Anderson (born May 1, 1969) is an American film maker. His films are known for their distinctive visual and narrative styles.[1] Anderson is regarded by many as a modern-day example of the auteur. He has received consistent praise from critics for his work, and three of his films — The Royal Tenenbaums, Moonrise Kingdom, and The Grand Budapest Hotel — appeared in BBC's 2016 poll of the greatest films since 2000.",
      "image" : "wesAnderson",
      "source" : "Source: Wikipedia, Photo by John Rasimus",
      "films" : [
        {"title" : "The Grand Budapest Hotel",
          "year": "2017",
          "poster" : "budapestHotel",
          "plot" : "The adventures of Gustave H, a legendary concierge at a famous hotel from the fictional Republic of Zubrowka between the first and second World Wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. (Source: IMDb API)" },
        {"title" : "The Life Aquatic with Steve Zissou",
          "year": "2004",
          "poster" : "lifeAquatic",
          "plot" : "When his partner is killed by the mysterious and possibly nonexistent Jaguar Shark, Steve Zissou and his Team Zissou crew set off for an expedition to hunt down the creature. Along with his estranged wife, a beautiful journalist and a co-pilot who could possibly be Zissou's son, the crew set off for one wild expedition. (Source: IMDb API)" },
        {"title" : "The Royal Tenenbaums",
          "year": "2001",
          "poster" : "royalTenenbaums",
          "plot" : "Three grown prodigies, all with a unique genius of some kind, and their mother are staying at the family household. Their father, Royal had left them long ago, and comes back to make things right with his family. (Source: IMDb API)" },
        {"title" : "Rushmore",
          "year": "1998",
          "poster" : "rushmore",
          "plot" : "Max Fischer is a precocious 15-year-old whose reason for living is his attendance at Rushmore, a private school where he's not doing well in any of his classes, but where he's the king of extracurricular activities - from being in the beekeeping society to writing and producing plays, there's very little after school he doesn't do. His life begins to change, however, when he finds out he's on academic probation, and when he stumbles into love with Miss Cross, a pretty teacher of the elementary school at Rushmore. Added to the mix is his friendship with Herman Blume, wealthy industrialist and father to boys who attend the school, and who also finds himself attracted to Miss Cross. Max's fate becomes inextricably tied to this odd love triangle, and how he sets about resolving it is the story in the film. (Source: IMDb API)" }
      ]
    },
    {
      "name" : "Jane Campion",
      "bio" : "Dame Elizabeth Jane Campion (born 30 April 1954) is a New Zealand screenwriter, producer, and director. Campion is the second of five women ever nominated for the Academy Award for Best Director and is the first — and thus far, only — female filmmaker in history to receive the Palme d'Or, which she received for directing the acclaimed film The Piano (1993), for which she also won the Academy Award for Best Original Screenplay.",
      "image" : "janeCampion",
      "source" : "Source: Wikipedia, Photo by Georges Biard",
      "films" : [
        {"title" : "Bright Star",
          "year": "2009",
          "poster" : "brightStar",
          "plot" : "It's 1818 in Hampstead Village on the outskirts of London. Poet Charles Brown lives in one half of a house, the Dilkes family who live in the other half. Through their association with the Dilkes, the fatherless Brawne family know Mr. Brown. The Brawne's eldest daughter, Fanny Brawne, and Mr. Brown don't like each other. She thinks he's arrogant and rude, and he feels that she is pretentious, knowing only how to sew (admittedly well as she makes all her own fashionable clothes), flirt and give opinions on subjects about which she knows nothing. Insecure struggling poet John Keats comes to live with his friend, Mr. Brown. Miss Brawne and Mr. Keats have a mutual attraction to each other, a relationship which however is slow to develop in part since Mr. Brown does whatever he can to keep the two apart. But other obstacles face the couple, including their eventual overwhelming passion for each other clouding their view of what the other does, Mr. Keats' struggling career which offers him ... (Source: IMDb API)" },
        {"title" : "In the Cut",
          "year": "2003",
          "poster" : "inTheCut",
          "plot" : "Frannie Avery is a New York City inner city high school English teacher, whose passion is collecting words and phrases that interest her, either because of their meaning and/or just because of the way they sound. The way that she and her paternal half sister Pauline Avery, her closest confidante, deal with men and sex has largely been affected by their father, who is working on marrying wife number five. Frannie thinks about sex more than she has it. Her lack of a sex life is further exacerbated by being the object of obsession of James Graham, a man with who she had a few casual dates and two sexual encounters, which has made her even more cautious. This complete experience is why she has a somewhat inappropriate, albeit non-sexual relationship with Cornelius Webb, one of her students. She eventually embarks on a sexual relationship with NYPD Homicide Detective Giovanni Malloy, who, along with his partner Detective Ritchie Rodriguez, are investigating the murder of a young woman, ... (Source: IMDb API)" },
        {"title" : "Holy Smoke",
          "year": "1999",
          "poster" : "holySmoke",
          "plot" : "While on a journey of discovery in exotic India, beautiful young Ruth Barron falls under the influence of a charismatic religious guru. Her desperate parents then hire PJ Waters, a macho cult de-programmer who confronts Ruth in a remote desert hideaway. But PJ quickly learns that he's met his match in the sexy, intelligent and iron-willed Ruth! (Source: IMDb API)" },
        {"title" : "The Piano",
          "year": "1993",
          "poster" : "thePiano",
          "plot" : "It is the mid-nineteenth century. Ada is a mute who has a young daughter, Flora. In an arranged marriage she leaves her native Scotland accompanied by her daughter and her beloved piano. Life in the rugged forests of New Zealand's North Island is not all she may have imagined and nor is her relationship with her new husband Stewart. She suffers torment and loss when Stewart sells her piano to a neighbour, George. Ada learns from George that she may earn back her piano by giving him piano lessons, but only with certain other conditions attached. At first Ada despises George but slowly their relationship is transformed and this propels them into a dire situation. (Source: IMDb API)" }
      ]
    },
    {
      "name" : "John Carpenter",
      "bio" : "John Howard Carpenter (born January 16, 1948) is an American filmmaker, screenwriter, musician, and composer. Although Carpenter has worked with various film genres, he is associated most commonly with horror, action and science fiction films of the 1970s and 1980s.",
      "image" : "johnCarpenter",
      "source" : "Source: Wikipedia, Photo by Nathan Hartley Maas",
      "films" : [
        {"title" : "They Live",
          "year": "1988",
          "poster" : "theyLive",
          "plot" : "Nada, a down-on-his-luck construction worker, discovers a pair of special sunglasses. Wearing them, he is able to see the world as it really is: people being bombarded by media and government with messages like \"Stay Asleep\", \"No Imagination\", \"Submit to Authority\". Even scarier is that he is able to see that some usually normal-looking people are in fact ugly aliens in charge of the massive campaign to keep humans subdued. (Source: IMDb API)" },
        {"title" : "The Thing",
          "year": "1982",
          "poster" : "theThing",
          "plot": "A US research station, Antarctica, early-winter 1982. The base is suddenly buzzed by a helicopter from the nearby Norwegian research station. They are trying to kill a dog that has escaped from their base. After the destruction of the Norwegian chopper the members of the US team fly to the Norwegian base, only to discover them all dead or missing. They do find the remains of a strange creature the Norwegians burned. The Americans take it to their base and deduce that it is an alien life form. After a while it is apparent that the alien can take over and assimilate into other life forms, including humans, and can spread like a virus. This means that anyone at the base could be inhabited by The Thing, and tensions escalate. (Source: IMDb API)"},
        {"title" : "Escape from New York",
          "year": "1981",
          "poster" : "escapeNewYork",
          "plot" : "In the future, crime is out of control and New York City's Manhattan is a maximum security prison. Grabbing a bargaining chip right out of the air, convicts bring down the President's plane in bad old Gotham. Gruff Snake Plissken, a one-eyed lone warrior new to prison life, is coerced into bringing the President, and his cargo, out of this land of undesirables. (Source: IMDb API)" },
        {"title" : "Halloween",
          "year": "1978",
          "poster" : "halloween",
          "plot" : "The year is 1963, the night: Halloween. Police are called to 43 Lampkin Ln. only to discover that 15 year old Judith Myers has been stabbed to death, by her 6 year-old brother, Michael. After being institutionalized for 15 years, Myers breaks out on the night before Halloween. No one knows, nor wants to find out, what will happen on October 31st 1978 besides Myers' psychiatrist, Dr. Loomis. He knows Michael is coming back to Haddonfield, but by the time the town realizes it, it'll be too late for many people. (Source: IMDb API)" }
      ]
    },
    {
      "name" : "David Cronenberg",
      "bio" : "David Paul Cronenberg (born March 15, 1943) is a Canadian filmmaker, writer, and actor. He is one of the principal originators of what is commonly known as the body horror genre, with his films exploring visceral bodily transformation, infection, technology, and the intertwining of the psychological with the physical. In the first half of his career, he explored these themes mostly through horror and science fiction films such as Scanners (1981) and Videodrome (1983), although his work has since expanded beyond these genres.",
      "image" : "davidCronenberg",
      "source" : "Source: Wikipedia, Photo by Alan Langford",
      "films" : [
        {"title" : "eXistenZ",
          "year": "1999",
          "poster" : "existenz",
          "plot" : "Allegra Geller, the leading game designer in the world, is testing her new virtual reality game, eXistenZ with a focus group. As they begin, she is attacked by a fanatic assassin employing a bizarre organic gun. She flees with a young marketing trainee, Ted Pikul, who is suddenly assigned as her bodyguard. Unfortunately, her pod, an organic gaming device that contains the only copy of the eXistenZ game program, is damaged. To inspect it, she talks Ted into accepting a gameport in his own body so he can play the game with her. The events leading up to this, and the resulting game lead the pair on a strange adventure where reality and their actions are impossible to determine from either their own or the game's perspective. (Source: IMDb API)" },
        {"title" : "The Fly",
          "year": "1986",
          "poster" : "theFly",
          "plot" : "Seth Brundle (Jeff Goldblum), a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife (Geena Davis) by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote \"Be afraid. Be very afraid.\" (Source: IMDb API)" },
        {"title" : "Videodrome",
          "year": "1983",
          "poster" : "videodrome",
          "plot" : "Max Renn runs a TV channel, and when looking for new material to show he discovers \"Videodrome.\" His girlfriend, Nicki Brand, goes to audition for the show, and Max gets drawn into the underlying plot that uses the show as its front for a global conspiracy. (Source: IMDb API)" },
        {"title" : "Scanners",
          "year": "1981",
          "poster" : "scanners",
          "plot" : "Darryl Revok is the most powerful of all the scanners, and is the head of the underground scanner movement for world domination. Scanners have great psychic power, strong enough to control minds; they can inflict enormous pain/damage on their victims. Doctor Paul Ruth finds a scanner that Revok hasn't, and converts him to their cause - to destroy the underground movement. (Source: IMDb API)" }
      ]
    },
    {
      "name" : "Spike Lee",
      "bio" : "Shelton Jackson \"Spike\" Lee (born March 20, 1957) is an American film director, producer, writer, and actor. His production company, 40 Acres and a Mule Filmworks, has produced over 35 films since 1983. He made his directorial debut with She's Gotta Have It (1986), and has since directed such films as Do the Right Thing (1989), Malcolm X (1992), The Original Kings of Comedy (2000), 25th Hour (2002), Inside Man (2006), Chi-Raq (2015), and BlacKkKlansman (2018). Lee has also acted in ten of his own films.",
      "image" : "spikeLee",
      "source" : "Source: Wikipedia, Photo by David Shankbone",
      "films" : [
        {"title" : "Black Klansman",
          "year": "2018",
          "poster" : "blackKlansman",
          "plot" : "Ron Stallworth, an African-American police officer from Colorado, successfully managed to infiltrate the local Ku Klux Klan and became the head of the local chapter. (Source: IMDb API)" },
        {"title" : "Malcolm X",
          "year": "1992",
          "poster" : "malcomX",
          "plot" : "Biograpical epic of Malcolm X, the legendary African American leader. Born Malcolm Little, his father (a Garveyite Baptist minister) was killed by the Ku Klux Klan. Malcolm became a gangster, and while in jail discovered the Nation of Islam writings of Elijah Muhammad. He preaches the teachings when let out of jail, but later on goes on a pilgrimage to the city of Mecca, there he converts to the original Islamic religion and becomes a Sunni Muslim and changes his name to El-Hajj Malik Al-Shabazz. He is assassinated on February 21, 1965 and dies a Muslim martyr. (Source: IMDb API)" },
        {"title" : "Jungle Fever",
          "year": "1991",
          "poster" : "jungleFever",
          "plot" : "A successful and married black man contemplates having an affair with a white girl from work. He's quite rightly worried that the racial difference would make an already taboo relationship even worse. (Source: IMDb API)" },
        {"title" : "Do the Right Thing",
          "year": "1989",
          "poster" : "doTheRightThing",
          "plot" : "This film looks at life in the Bedford-Stuyvesant district of Brooklyn on a hot summer Sunday. As he does everyday, Sal Fragione opens the pizza parlor he's owned for 25 years. The neighborhood has changed considerably in the time he's been there and is now composed primarily of African-Americans and Hispanics. His son Pino hates it there and would like nothing better than to relocate the eatery to their own neighborhood. For Sal however, the restaurant represents something that is part of his life and sees it as a part of the community. What begins as a simple complaint by one of his customers, Buggin Out - who wonders why he has only pictures of famous Italian-Americans on the wall when most of his customers are black - eventually disintegrates into violence as frustration seemingly brings out the worst in everyone. (Source: IMDb API)" }
      ]
    },
    {
      "name" : "Martin Scorsese",
      "bio" : "Martin Charles Scorsese (born November 17, 1942) is an American director, producer, screenwriter, actor, and film historian, whose career spans more than 50 years. Scorsese's body of work addresses such themes as Sicilian-American identity, Roman Catholic concepts of guilt and redemption, faith, machismo, modern crime, and gang conflict. Many of his films are also known for their depiction of violence and liberal use of profanity.",
      "image" : "martinScorsese",
      "source" : "Source: Wikipedia, Photo by Siebbi",
      "films" : [
        {"title" : "The Departed",
          "year": "2006",
          "poster" : "departed",
          "plot" : "A Chicago police officer is set to infiltrate a Latino crime crew while a member of the same crew serves as a rat at the police. (Source: IMDb API)" },
        {"title" : "Goodfellas",
          "year": "1990",
          "poster" : "goodfellas",
          "plot" : "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy? (Source: IMDb API)" },
        {"title" : "Raging Bull",
          "year": "1980",
          "poster" : "ragingBull",
          "plot" : "When Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone. (Source: IMDb API)" },
        {"title" : "Taxi Driver",
          "year": "1976",
          "poster" : "taxiDriver",
          "plot" : "Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew. (Source: IMDb API)" },
      ]
    }
  ]
}

